app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    render json: Article.all

INSERT INTO "articles" ("user_id", "title", "topic", "story", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    article = Article.create!(article_params)

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
---
  def destroy
    article = find_article
    article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_article
    Article.find_by(id: params[:id])